---
kind: method
id: M:Autodesk.Revit.DB.SpecUtils.GetAllSpecs
source: html/a93168f7-b52d-e97a-7935-50ddcec7fb54.htm
---
# Autodesk.Revit.DB.SpecUtils.GetAllSpecs Method

Gets the identifiers of all specs.

## Syntax (C#)
```csharp
public static IList<ForgeTypeId> GetAllSpecs()
```

## Returns
The spec identifiers.